Table of Contents
 Class CrossSectionComponentEdges
Namespace
IdeaRS.OpenModel.Loading
Assembly
IdeaRS.OpenModel.dll
Cross-section component edges
[OpenModelClass("CI.StructModel.Loading.CrossSectionComponentEdges,CI.Loading")]
public class CrossSectionComponentEdges : OpenObject
Inheritance
object
OpenObject
CrossSectionComponentEdges
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 CrossSectionComponentEdges()
Constructor
public CrossSectionComponentEdges()
Properties
 ComponentIndex
Zero based index of component
public int ComponentIndex { get; set; }
Property Value
int
 EdgeIndexes
List of zero based edge indexes of component
public List<int> EdgeIndexes { get; set; }
Property Value
List<int>
 Edit this page